spec/fixtures/tnt_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.calculoFrete.mercurio.com" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://model.vendas.lms.mercurio.com" xmlns:ins1="http://model.expedicao.lms.mercurio.com"><env:Body><tns:calculaFrete><tns:in0><ins0:cdDivisaoCliente>1</ins0:cdDivisaoCliente><ins0:cepDestino>80035120</ins0:cepDestino><ins0:cepOrigem>03320000</ins0:cepOrigem><ins0:login>foo@bar.com</ins0:login><ins0:nrIdentifClienteDest>0000000191</ins0:nrIdentifClienteDest><ins0:nrIdentifClienteRem>12345678901234</ins0:nrIdentifClienteRem><ins0:nrInscricaoEstadualDestinatario></ins0:nrInscricaoEstadualDestinatario><ins0:nrInscricaoEstadualRemetente>12345</ins0:nrInscricaoEstadualRemetente><ins0:psReal>0.000</ins0:psReal><ins0:senha></ins0:senha><ins0:tpFrete>C</ins0:tpFrete><ins0:tpPessoaDestinatario>F</ins0:tpPessoaDestinatario><ins0:tpPessoaRemetente>J</ins0:tpPessoaRemetente><ins0:tpServico>RNC</ins0:tpServico><ins0:tpSituacaoTributariaDestinatario>CO</ins0:tpSituacaoTributariaDestinatario><ins0:tpSituacaoTributariaRemetente>CO</ins0:tpSituacaoTributariaRemetente><ins0:vlMercadoria>0.00</ins0:vlMercadoria></tns:in0></tns:calculaFrete></env:Body></env:Envelope>
